{
    "init": {
        "message": "You've reached Forest of the Damned, an SMS-based game! Text BEGIN to this number to start a new game. Text CMDS for a list of all commands. (Note: Commands are case-sensitive.)",
        "choices": {}
    },
    "intro": {
        "message": "Welcome to Forest of the Damned! Throughout the game, you will see actions surrounded with [brackets]. Text us that phrase without the brackets to perform the action. (Case does not matter.) Type [ok] to continue.",
        "choices": {
            "ok": "story_intro",
            "brackets": "secret"
        }
    },
    "secret": {
        "message": "We only surrounded the word 'brackets' in brackets to connect the characters to their name. Nonetheless, your usage is correct according to the rule we just taught you. We respect your outside-the-box thinking, so consider this an Easter Egg!\n\nText anything to continue.",
        "choices": {},
        "next_state": "story_intro"
    },
    "story_intro": {
        "message": "You are a prisoner that has been ordered by the fascist state to hunt down crystals essential for their empire. The guards pushed you out of the truck ordering you to mine or be executed. The dark forest is known as a no-man's land, as prisoners ordered to mine have never returned.",
        "choices": {},
        "next_state": "1, 1"
    },
    "end": {
        "message": "This is just a test; that is all for now. Text BEGIN to start a new game.",
        "choices": {},
        "next_state": "end"
    },
    "first_crystal": {
        "message": "You have mined and found the first crystal. Though something seems off. The forest seems unusually quiet and the crows that produced the only sound apart from your footsteps seem to die down. You believe that you should return with what you have? Would you?",
        "next_state": "1, 2",
        "data": {
            "crystal": [1],
            "pickaxe": -1
        },
        "choices": {}
    },
    "1, 1": {
        "message": "You are at (1,1)",
        "choices": {
            "south": "1, 2",
            "east": "2, 1"
        }
    },
    "1, 2": {
        "message": "You see something glowing in the wall. Type [mine] to find the first crystal.",
        "choices": {
            "mine": "first_crystal"
        }
    },
    "1, 3": {},
    "1, 4": {},
    "2, 1": {},
    "2, 2": {},
    "2, 3": {},
    "2, 4": {},
    "3, 1": {},
    "3, 2": {},
    "3, 3": {},
    "3, 4": {},
    "4, 1": {},
    "4, 2": {},
    "4, 3": {},
    "4, 4": {}
}
